app/Controllers/Admin.php

    public function index()
    {
        // Load the necessary models
        $notificationModel = new NotificationModel();

        // Get all notifications
        $notifications = $notificationModel->findAll();

        // Count the number of pending notifications
        $notificationCount = $notificationModel->where('status','pending')->countAllResults();
---
SELECT *
FROM `tbl_notifications`
SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `status` = 'pending'

    public function accept()
{
    // Load the necessary models
    $notificationModel = new NotificationModel();
    $vendorModel = new VendorModel();

    // Find the notification with the status 'pending'
    $notification = $notificationModel->where('status', 'pending')->first();

    if (!$notification) {
        // Notification not found, handle the error accordingly
        return redirect()->back()->with('error', 'Notification not found');
    }

    // Retrieve the vendor_id from the notification
    $vendorId = $notification['vendor_id'];

    // Update the status of the notification
    $notificationModel->where('vendor_id', $vendorId)->set(['status' => 'approved'])->update();

    // Update the status of the vendor in tbl_vendor
    $vendorModel->where('vendor_id', $vendorId)->set(['status' => 'approved'])->update();

    // Retrieve the vendor details
    $vendor = $vendorModel->find($vendorId);
---
SELECT *
FROM `tbl_notifications`
WHERE `status` = 'pending'
 LIMIT 1
UPDATE `tbl_notifications` SET `status` = 'approved'
WHERE `vendor_id` = '38765432'
UPDATE `tbl_vendor` SET `status` = 'approved'
WHERE `vendor_id` = '38765432'
SELECT *
FROM `tbl_vendor`
WHERE `tbl_vendor`.`vendor_id` = '38765432'

    public function viewUsers()
    {
        $model = new Users();
        $data['users'] = $model->findAll(); // Fetch all users from the model

        $notificationModel = new NotificationModel();
        $notificationCount = $notificationModel->where('status','pending')->countAllResults();
---
SELECT *
FROM `tbl_users`
SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `status` = 'pending'