app/Controllers/Auth.php

    public function index()
    {
        $rules = [
            'firstname' => ['rules' => 'required|min_length[1]|max_length[255]'],
            'lastname' => ['rules' => 'required|min_length[1]|max_length[255]'],
            'username' => ['rules' => 'required|min_length[1]|max_length[255]|is_unique[tbl_users.username]'],
            'dob' => ['rules' => 'required|min_length[4]|max_length[10]'],
            'number' => ['rules' => 'required|min_length[9]|max_length[10]'],
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[tbl_users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password' => ['label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if ($this->validate($rules)) {
            $model = new Users();
            $data = [
                'firstname' => $this->request->getPost('firstname'),
                'lastname' => $this->request->getPost('lastname'),
                'dob' => $this->request->getPost('dob'),
                'number' => $this->request->getPost('number'),
                'username' => $this->request->getPost('username'),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role' => '2'
            ];
            $model->save($data);
---
INSERT INTO `tbl_users` (`firstname`, `lastname`, `dob`, `number`, `username`, `email`, `password`, `role`) VALUES ('Anne', 'Marie', '6/3/1990', '0703221345', 'anne-marie', 'humphreydulo73@gmail.com', '$2y$10$5PuzGH.w1jnzIpNuZdgYzO5RfYRlCO7ZXIuOaoTvA9QJTOTHkFvym', '2')

            ];


            $activationModel->insert($activationData);
---
INSERT INTO `tbl_activation` (`id`, `activation_code`) VALUES (2, 'b451e8c2952deb581c')