app/Controllers/Dashboard.php

    public function dashboard()
    {
        // Load the necessary models and retrieve the notification count
        $notificationModel = new NotificationModel();
        $notificationCount = $notificationModel->countAll();

        $notificationCount = $notificationModel->where('status', 'pending')->countAllResults();


             // Count the number of pending notifications
             $notificationCount = $notificationModel->where('status','pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_notifications`
SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `status` = 'pending'