app/Controllers/Log.php

SELECT *
FROM `tbl_users`
WHERE `username` = 'kihanyavendor'
 LIMIT 1
---
    public function index()
    {
        $data = [];
       helper(['form']);



        $rules = [
            'username' => ['rules' => 'required|min_length[1]|max_length[255]'],
            'password' => ['rules' => 'required']
        ];

        if ($this->validate($rules)) {
            $model = new Users();
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Check if the user exists in the database
            $user = $model->where('username', $username)->first();

INSERT INTO `tbl_activation` (`id`, `activation_code`) VALUES ('8', '5a9bc02412c2a24a09')
---
                            'id' => $user['id'],
                            'activation_code' => $activationCode,
                        ];
                        $activationModel->insert($activationData);